app/views/questions/show.html.erb

<h2>Answers</h2>
<% @question.answers.each do |answer| %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = 6