app/controllers/answers_controller.rb

  def create
    @question = Question.find(params[:question_id])
    @answer = @question.answers.create(params[:answer])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", "9"]]
INSERT INTO "answers" ("answer", "created_at", "question_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["answer", "asdasd"], ["created_at", Wed, 22 Aug 2018 04:48:03 UTC +00:00], ["question_id", 7], ["updated_at", Wed, 22 Aug 2018 04:48:03 UTC +00:00], ["user_id", nil]]