app/controllers/questions_controller.rb

  def create
  	@question = Question.new(params[:question])
  	if @question.save
---
INSERT INTO "questions" ("created_at", "question", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 17 Aug 2018 10:43:13 UTC +00:00], ["question", nil], ["updated_at", Fri, 17 Aug 2018 10:43:13 UTC +00:00]]

  def update
    @question = Question.find(params[:id])
    if @question.update(params[:question])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "questions" SET "question" = 'jhjhkjkkkk', "updated_at" = '2018-08-18 09:30:10.450081' WHERE "questions"."id" = 5

  def index
  	@question = Question.all
---
SELECT "questions".* FROM "questions"