app/controllers/votes_controller.rb

	def create
		if @vote.save
---
INSERT INTO "votes" ("answer_id", "created_at", "updated_at", "user_id", "votes") VALUES (?, ?, ?, ?, ?)  [["answer_id", 4], ["created_at", Wed, 22 Aug 2018 07:08:36 UTC +00:00], ["updated_at", Wed, 22 Aug 2018 07:08:36 UTC +00:00], ["user_id", 1], ["votes", nil]]
UPDATE "votes" SET "votes" = 2, "updated_at" = '2018-08-22 08:42:58.064674' WHERE "votes"."id" = 4