app/views/votes/_form.html.erb

		<%= f.submit "UpVote" %>
	<%= Vote.find(:all, :conditions => {:answer_id => @answer.id}).count %> Vote(s)
---
SELECT "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT 1  [["id", 11]]